<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"8b193f7818a4d172e5add3df2571e606b5f0b45480aa6f51eca30969f0c6fbb4","plan_job_ref":"Job Pull Request Checks #3222 at https://github.com/GSA-TTS/FAC/actions/runs/9624837953","plan_out_hash":"9f295000da666c09bbad53b7ec70aa7aac5a500f09fbdcf62012cdbe87441e8f","plan_hash":"719fa068ab2a8b53502ef802cdbaa9298721b6ef191d36a6d2a6ecfe07134c12","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 7 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # module.production.cloudfoundry_app.postgrest will be updated in-place
!~  resource "cloudfoundry_app" "postgrest" {
!~      docker_image                    = "ghcr.io/gsa-tts/fac/postgrest@sha256:4b903ac223ea5f583bd870a328a3cf54d19267e5b5abfff896863b37f7cb68b6" -> "ghcr.io/gsa-tts/fac/postgrest@sha256:08852a35ccf68490cf974e2b1a47d19480457c24b2244fa9f302ed785bd89462"
        id                              = "70ac44be-3507-4867-a75f-c2d1ab12ee89"
        name                            = "postgrest"
#        (17 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.production.module.clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:b0e61e765f6c9a861cb8a4fbcfbd1df3e45fcbfa7cd78cd67c16d2e540d5301d" -> "ghcr.io/gsa-tts/fac/clamav@sha256:ba95b2eab2464f762071de942b60190be73c901a17a143b234ac3a53dc947d68"
        id                              = "5d0afa4f-527b-472a-8671-79a60335417f"
        name                            = "fac-av-production"
#        (17 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.production.module.file_scanner_clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:b0e61e765f6c9a861cb8a4fbcfbd1df3e45fcbfa7cd78cd67c16d2e540d5301d" -> "ghcr.io/gsa-tts/fac/clamav@sha256:ba95b2eab2464f762071de942b60190be73c901a17a143b234ac3a53dc947d68"
        id                              = "a14bb29f-8276-4967-9754-cf9c4187ebe3"
        name                            = "fac-av-production-fs"
#        (17 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.production.module.https-proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
        id                              = "5e81ca8b-99cf-41f8-ae42-76652d51a44c"
        name                            = "https-proxy"
!~      source_code_hash                = "e246274fca627d48afccde010de949371f24b6c9974c48aa91044acd36654fa8" -> "9fcf4a7f6abfc9a220de2b8bb97591ab490a271ac0933b984f606f645319e1a4"
#        (21 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.production.module.newrelic.newrelic_alert_policy.alert_policy will be created
+   resource "newrelic_alert_policy" "alert_policy" {
+       account_id          = (known after apply)
+       id                  = (known after apply)
+       incident_preference = "PER_POLICY"
+       name                = "production-alert-policy"
    }

  # module.production.module.newrelic.newrelic_notification_channel.email_channel will be created
+   resource "newrelic_notification_channel" "email_channel" {
+       account_id     = 3919076
+       active         = true
+       destination_id = (known after apply)
+       id             = (known after apply)
+       name           = "production_email_notification_channel"
+       product        = "IINT"
+       status         = (known after apply)
+       type           = "EMAIL"

+       property {
+           key           = "subject"
+           value         = "{{issueTitle}}"
#            (2 unchanged attributes hidden)
        }
    }

  # module.production.module.newrelic.newrelic_notification_destination.email_destination will be created
+   resource "newrelic_notification_destination" "email_destination" {
+       account_id = 3919076
+       active     = true
+       guid       = (known after apply)
+       id         = (known after apply)
+       last_sent  = (known after apply)
+       name       = "email_destination"
+       status     = (known after apply)
+       type       = "EMAIL"

+       property {
+           key           = "email"
+           value         = "daniel.swick@gsa.gov, matthew.jadud@gsa.gov, alexander.steel@gsa.gov"
#            (2 unchanged attributes hidden)
        }
    }

  # module.production.module.newrelic.newrelic_nrql_alert_condition.error_transactions will be created
+   resource "newrelic_nrql_alert_condition" "error_transactions" {
+       account_id                   = 3919076
+       aggregation_delay            = "120"
+       aggregation_method           = "event_flow"
+       aggregation_window           = 60
+       enabled                      = true
+       entity_guid                  = (known after apply)
+       id                           = (known after apply)
+       name                         = "Error Transactions (%)"
+       policy_id                    = (known after apply)
+       type                         = "static"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       critical {
+           operator              = "above"
+           threshold             = 5
+           threshold_duration    = 300
+           threshold_occurrences = "all"
        }

+       nrql {
+           query = "SELECT percentage(count(*), WHERE error is true) FROM Transaction"
        }

+       warning {
+           operator              = "above"
+           threshold             = 3
+           threshold_duration    = 300
+           threshold_occurrences = "all"
        }
    }

  # module.production.module.newrelic.newrelic_nrql_alert_condition.infected_file_found will be created
+   resource "newrelic_nrql_alert_condition" "infected_file_found" {
+       account_id                   = (known after apply)
+       aggregation_delay            = "120"
+       aggregation_method           = "event_flow"
+       aggregation_window           = 60
+       enabled                      = true
+       entity_guid                  = (known after apply)
+       fill_option                  = "static"
+       fill_value                   = 0
+       id                           = (known after apply)
+       name                         = "Infected File Found!"
+       policy_id                    = (known after apply)
+       type                         = "static"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       critical {
+           operator              = "above_or_equals"
+           threshold             = 1
+           threshold_duration    = 300
+           threshold_occurrences = "at_least_once"
        }

+       nrql {
+           query = "SELECT count(*) FROM Log WHERE tags.space_name ='production' and message LIKE '%ScanResult.INFECTED%'"
        }
    }

  # module.production.module.newrelic.newrelic_one_dashboard.search_dashboard will be created
+   resource "newrelic_one_dashboard" "search_dashboard" {
+       account_id  = (known after apply)
+       guid        = (known after apply)
+       id          = (known after apply)
+       name        = "Search Dashboard (production)"
+       permalink   = (known after apply)
+       permissions = "public_read_only"

+       page {
+           guid = (known after apply)
+           name = "Search"

+           widget_billboard {
+               column         = 1
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 1
+               title          = "Searches Per Hour"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(*) as 'Total', rate(count(*), 1 minute) as 'Per Minute' FROM Transaction where request.uri like '%/dissemination/search%' and request.method = 'POST' and appName = 'gsa-fac-production' since 1 hours AGO COMPARE WITH 1 week ago"
                }
            }

+           widget_line {
+               column         = 4
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 1
+               title          = "Search Traffic"
+               width          = 6

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(*) FROM Transaction where request.uri like '%/dissemination/search%' and request.method = 'POST' and appName = 'gsa-fac-production' since 4 hours AGO COMPARE WITH 1 week ago TIMESERIES"
                }
            }
+           widget_line {
+               column         = 1
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 2
+               title          = "Search Response Time"
+               width          = 6

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "FROM Metric SELECT average(newrelic.timeslice.value) WHERE appName = 'gsa-fac-production' WITH METRIC_FORMAT 'Custom/search' TIMESERIES SINCE 1 day ago COMPARE WITH 1 week ago"
                }
            }
        }
    }

  # module.production.module.newrelic.newrelic_workflow.alert_workflow will be created
+   resource "newrelic_workflow" "alert_workflow" {
+       account_id            = (known after apply)
+       destinations_enabled  = true
+       enabled               = true
+       enrichments_enabled   = true
+       guid                  = (known after apply)
+       id                    = (known after apply)
+       last_run              = (known after apply)
+       muting_rules_handling = "DONT_NOTIFY_FULLY_MUTED_ISSUES"
+       name                  = "production_alert_workflow"
+       workflow_id           = (known after apply)

+       destination {
+           channel_id            = (known after apply)
+           name                  = (known after apply)
+           notification_triggers = (known after apply)
+           type                  = (known after apply)
        }

+       issues_filter {
+           filter_id = (known after apply)
+           name      = "filter"
+           type      = "FILTER"

+           predicate {
+               attribute = "labels.policyIds"
+               operator  = "EXACTLY_MATCHES"
+               values    = (known after apply)
            }
        }
    }

Plan: 7 to add, 4 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.domain.cloudfoundry_service_instance.external_domain_instance,
  on /tmp/terraform-data-dir/modules/domain/domain/main.tf line 45, in resource "cloudfoundry_service_instance" "external_domain_instance":
  45:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases

(and 5 more similar warnings elsewhere)
```
</details>

:memo: Plan generated in [Pull Request Checks #3222](https://github.com/GSA-TTS/FAC/actions/runs/9624837953)